---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CutLineType
source: html/9c592d5d-5092-1f25-7b9b-db7613cf5f64.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CutLineType Property

"Cut Line Type"

## Syntax (C#)
```csharp
public static ForgeTypeId CutLineType { get; }
```